{"format": "layers-model", "generatedBy": "keras v2.4.0", "convertedBy": "TensorFlow.js Converter v3.5.0", "modelTopology": {"keras_version": "2.4.0", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 128], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "batch_input_shape": [null, 128], "dtype": "float32", "input_dim": 69, "output_dim": 128, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 128}, "name": "embedding_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "config": {"name": "conv1d", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [5], "strides": [1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv1d", "inbound_nodes": [[["embedding_1", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "config": {"name": "max_pooling1d", "trainable": true, "dtype": "float32", "strides": [10], "pool_size": [10], "padding": "valid", "data_format": "channels_last"}, "name": "max_pooling1d", "inbound_nodes": [[["conv1d", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_3", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_3", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 256, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.3, "recurrent_dropout": 0.3, "implementation": 1}}, "merge_mode": "concat"}, "name": "bidirectional_3", "inbound_nodes": [[["max_pooling1d", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_4", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_4", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 256, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.3, "recurrent_dropout": 0.3, "implementation": 1}}, "merge_mode": "concat"}, "name": "bidirectional_4", "inbound_nodes": [[["bidirectional_3", 0, 0, {}]]]}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_5", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_5", "trainable": true, "dtype": "float32", "return_sequences": false, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 128, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.3, "recurrent_dropout": 0.3, "implementation": 1}}, "merge_mode": "concat"}, "name": "bidirectional_5", "inbound_nodes": [[["bidirectional_4", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 1, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["bidirectional_5", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_1", 0, 0]]}}, "training_config": {"loss": "binary_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "binary_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 0.0010000000474974513, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of4.bin", "group1-shard2of4.bin", "group1-shard3of4.bin", "group1-shard4of4.bin"], "weights": [{"name": "bidirectional_3/forward_lstm_3/lstm_cell_10/kernel", "shape": [512, 1024], "dtype": "float32"}, {"name": "bidirectional_3/forward_lstm_3/lstm_cell_10/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional_3/forward_lstm_3/lstm_cell_10/bias", "shape": [1024], "dtype": "float32"}, {"name": "bidirectional_3/backward_lstm_3/lstm_cell_11/kernel", "shape": [512, 1024], "dtype": "float32"}, {"name": "bidirectional_3/backward_lstm_3/lstm_cell_11/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional_3/backward_lstm_3/lstm_cell_11/bias", "shape": [1024], "dtype": "float32"}, {"name": "bidirectional_4/forward_lstm_4/lstm_cell_13/kernel", "shape": [512, 1024], "dtype": "float32"}, {"name": "bidirectional_4/forward_lstm_4/lstm_cell_13/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional_4/forward_lstm_4/lstm_cell_13/bias", "shape": [1024], "dtype": "float32"}, {"name": "bidirectional_4/backward_lstm_4/lstm_cell_14/kernel", "shape": [512, 1024], "dtype": "float32"}, {"name": "bidirectional_4/backward_lstm_4/lstm_cell_14/recurrent_kernel", "shape": [256, 1024], "dtype": "float32"}, {"name": "bidirectional_4/backward_lstm_4/lstm_cell_14/bias", "shape": [1024], "dtype": "float32"}, {"name": "bidirectional_5/forward_lstm_5/lstm_cell_16/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "bidirectional_5/forward_lstm_5/lstm_cell_16/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "bidirectional_5/forward_lstm_5/lstm_cell_16/bias", "shape": [512], "dtype": "float32"}, {"name": "bidirectional_5/backward_lstm_5/lstm_cell_17/kernel", "shape": [512, 512], "dtype": "float32"}, {"name": "bidirectional_5/backward_lstm_5/lstm_cell_17/recurrent_kernel", "shape": [128, 512], "dtype": "float32"}, {"name": "bidirectional_5/backward_lstm_5/lstm_cell_17/bias", "shape": [512], "dtype": "float32"}, {"name": "conv1d/kernel", "shape": [5, 128, 512], "dtype": "float32"}, {"name": "conv1d/bias", "shape": [512], "dtype": "float32"}, {"name": "dense_1/kernel", "shape": [256, 1], "dtype": "float32"}, {"name": "dense_1/bias", "shape": [1], "dtype": "float32"}, {"name": "embedding_1/embeddings", "shape": [69, 128], "dtype": "float32"}]}]}